DELETE FROM user_roles WHERE user_id = 110000;
DELETE FROM meals WHERE userid = 110000;
DELETE FROM users WHERE id = 110000;

INSERT INTO users (id, name, email, password) VALUES
(110000, 'Test', 'test@test.ru', 'test_password');

INSERT INTO user_roles (role, user_id) VALUES
('TEST_ROLE', 110000);

INSERT INTO meals (id, userId, datetime, description, calories) VALUES
(100001, 110000,'2020-04-04 10:00', 'Завтрак тестировщика', 500),
(100002, 110000,'2020-04-04 14:00', 'Обед тестировщика', 1000),
(100003, 110000,'2020-04-04 19:00', 'Ужин тестировщика', 500),
(100004, 110000,'2020-04-04 00:00', 'Еда на граничное значение тестировщика', 100),
(100005, 110000,'2020-04-05 10:00', 'Завтрак тестировщика', 1000),
(100006, 110000,'2020-04-05 14:00', 'Обед тестировщика', 500),
(100007, 110000,'2020-04-05 19:00', 'Ужин тестировщика', 410),
(100008, 100001,'2020-04-05 07:00', 'Завтрак НЕ для тестировщика', 410),
(100009, 100000,'2020-04-05 19:00', 'Ужин НЕ для тестировщика', 410);